owhinata/stm32f746g-disco/port/camera/camera.c
static volatile int      cam_stream_active;  /* streaming mode gate             */
static volatile int      cam_stop_req;       /* stop requested (producer drains)*/
static volatile int      cam_stream_err;     /* DCMI OVR -> terminal stop       */
static volatile uint32_t cam_stream_ovr;     /* DCMI overrun count              */
static volatile uint32_t cam_ring_ovr;       /* free-slot exhaustion / lost     */
static volatile uint32_t cam_stream_fe;      /* DMA FIFO/DME errors tolerated (#56) */
static volatile uint32_t cam_ring_slots;     /* ring depth this stream (#65 arena) */
static volatile uint32_t cam_ring_slot_bytes;/* ring slot stride this stream (#65) */
static uint32_t cam_start_tick;              /* HAL tick at start (--secs)       */
static uint32_t cam_target_frames;           /* 0 = unbounded                   */
static uint32_t cam_target_secs;             /* 0 = unbounded                   */
static uint32_t cam_last_ct;                 /* CT at last serviced completion  */
static struct frame_desc *cam_m0, *cam_m1;   /* slots currently in M0AR/M1AR    */
static struct frame_desc *cam_jpeg_slot;     /* JPEG stream: the single DMA target (#63) */
static volatile uint32_t cam_jpeg_trunc;     /* JPEG stream: frames with no SOI/EOI (#63) */

/* ---- locking ------------------------------------------------------------ */
/* Public API entries take the mutex here; all real work below lives in
   *_locked() helpers so no path ever re-acquires cam_lock (a capture in #41
   probes on demand by calling the _locked helper directly). */

static int op_lock(void)
{
	if (!cam_ready)
		return CAM_ERR_STATE;
	if (tx_mutex_get(&cam_lock, TX_WAIT_FOREVER) != TX_SUCCESS)
		return CAM_ERR_STATE;
	return 0;
}

static void op_unlock(void)
{
	tx_mutex_put(&cam_lock);
}

/* ---- OV5640 bus glue (OV5640_IO_t) --------------------------------------- */

/* OV5640_ReadID() calls IO.Init() unconditionally, so a real (if empty)
   function is mandatory; the peripheral is already up from camera_init(). */
static int32_t cam_io_init(void)
{
	return OV5640_OK;
}

static int32_t cam_io_deinit(void)
{
	return OV5640_OK;
}

static int32_t cam_io_gettick(void)
{
	return (int32_t)HAL_GetTick();
}

static int32_t cam_io_write(uint16_t addr, uint16_t reg, uint8_t *data,
                            uint16_t len)
{
	if (HAL_I2C_Mem_Write(&hcam_i2c, addr, reg, I2C_MEMADD_SIZE_16BIT,
	                      data, len, CAM_I2C_TIMEOUT_MS) != HAL_OK)
		return OV5640_ERROR;
	return OV5640_OK;
}

static int32_t cam_io_read(uint16_t addr, uint16_t reg, uint8_t *data,
                           uint16_t len)
{
	if (HAL_I2C_Mem_Read(&hcam_i2c, addr, reg, I2C_MEMADD_SIZE_16BIT,
	                     data, len, CAM_I2C_TIMEOUT_MS) != HAL_OK)
		return OV5640_ERROR;
	return OV5640_OK;
}

/* ---- mode timing / DCMI helpers (issue #45) ------------------------------ */

/* Toggle the DCMI hardware JPEG mode.  JPEGMode latches at HAL_DCMI_Init, so a
   switch needs a DeInit/Init with the new value; the cached hdcmi.Init keeps the
   sync/polarity/EDM config, and the DMA link + NVIC are restored after.  Only
   called under cam_lock with no capture in flight (stream/preview gate). */
static int dcmi_set_jpeg(int on)
{
	if (HAL_DCMI_DeInit(&hdcmi) != HAL_OK)
		return -1;
	hdcmi.Init.JPEGMode = on ? DCMI_JPEG_ENABLE : DCMI_JPEG_DISABLE;
	if (HAL_DCMI_Init(&hdcmi) != HAL_OK)
		return -1;
	__HAL_LINKDMA(&hdcmi, DMA_Handle, hdma_dcmi);
	return 0;
}

static int read_reg_u16(uint16_t reg_hi, uint16_t reg_lo, uint16_t *out)
{
	uint8_t hi, lo;

	if (cam_io_read(CAM_I2C_ADDR, reg_hi, &hi, 1) != OV5640_OK ||
	    cam_io_read(CAM_I2C_ADDR, reg_lo, &lo, 1) != OV5640_OK)
		return -1;
	*out = (uint16_t)(((uint16_t)hi << 8) | lo);
	return 0;
}

static int write_hts_vts(uint16_t hts, uint16_t vts)
{
	uint8_t b;

	b = (uint8_t)(hts >> 8);
	if (cam_io_write(CAM_I2C_ADDR, OV5640_TIMING_HTS_HIGH, &b, 1) != OV5640_OK)
		return -1;
	b = (uint8_t)hts;
	if (cam_io_write(CAM_I2C_ADDR, OV5640_TIMING_HTS_LOW, &b, 1) != OV5640_OK)
		return -1;
	b = (uint8_t)(vts >> 8);
	if (cam_io_write(CAM_I2C_ADDR, OV5640_TIMING_VTS_HIGH, &b, 1) != OV5640_OK)
		return -1;
	b = (uint8_t)vts;
	if (cam_io_write(CAM_I2C_ADDR, OV5640_TIMING_VTS_LOW, &b, 1) != OV5640_OK)
		return -1;
	return 0;
}

/* AEC needs VTS to cover the max exposure (in lines) or frames clip / band.  The
   OV5640 holds two max-exposure pairs (0x3A02/03 and 0x3A14/15, default 0x3D8 =
   984; night mode raises BOTH to ~0x0B88).  Write the mode's HTS and an effective
   VTS = max(mode.vts base, max exposure + margin) so the auto-exposure always has
   room, and refresh the live fps target.  mode.vts stays the fps-table base, so
   turning night mode off drops the effective VTS back to the table value.  Caller
   holds cam_lock and the sensor is configured. */
#define CAM_VTS_EXP_MARGIN  16u
static int apply_vts_locked(void)
{
	uint16_t e1, e2, eff;

	if (read_reg_u16(OV5640_AEC_CTRL02, OV5640_AEC_CTRL03, &e1) != 0 ||
	    read_reg_u16(OV5640_AEC_MAX_EXPO_HIGH, OV5640_AEC_MAX_EXPO_LOW, &e2) != 0)
		return -1;
	eff = (uint16_t)((e1 > e2 ? e1 : e2) + CAM_VTS_EXP_MARGIN);
	if (eff < mode.vts)
		eff = mode.vts;
	if (write_hts_vts(mode.hts, eff) != 0)
		return -1;
	if (mode.hts != 0u && eff != 0u)
		mode.fps_target_x10 = (uint16_t)((uint64_t)mode.pclk_hz * 10u /
		                                 ((uint32_t)mode.hts * eff));
	return 0;
}

/* Reset the mode descriptor to the power-on QVGA RGB565 default (common-table
   timing) and put the DCMI back to raster.  A power cycle / re-probe / failed
   mode switch returns here, so mode / sensor / DCMI stay mutually consistent. */
static void mode_reset_default(void)
{
	struct camera_mode d = {
		.res = CAM_RES_QVGA, .format = CAM_FMT_RGB565,
		.hts = 1600u, .vts = 1000u, .pclk_hz = 24000000u,   /* QVGA fps-table */
	};

	if (hdcmi.Init.JPEGMode == DCMI_JPEG_ENABLE)
		(void)dcmi_set_jpeg(0);
	/* Invalidate the lib's init cache too: OV5640_Init only re-writes the common
	   table / resolution / format while IsInitialized == 0 (ov5640.c sticky
	   guard), so without this a re-configure after a power cycle / failed switch
	   would be a no-op and leave the sensor unprogrammed (mode/sensor mismatch). */
	ov5640.IsInitialized = 0U;
	cam_sensor_pclk_hz = 0u;   /* sensor PLL back at power-on default (#67) */
	mode_recompute(&d);
	mode = d;
}

