owhinata/stm32f746g-disco/port/camera/camera.c
/* Apply the cached quality settings AND refresh the exposure-aware VTS in one
   shot: every settings application can change night mode, which raises the AEC
   max exposure, so the VTS clamp must run right after (otherwise a live `camera
   set night on` starves the auto-exposure at the fps-table VTS).  Caller holds
   cam_lock with the sensor configured and the mode committed. */
static int settings_and_timing_apply_locked(void)
{
	int rc = settings_apply_all_locked();   /* clears settings_dirty on success */

	if (rc != 0)
		return rc;
	rc = apply_vts_locked();
	if (rc != 0)
		settings_dirty = 1;   /* SDE applied but timing not: re-arm so the next
		                         configure re-applies settings AND re-clamps VTS,
		                         keeping the night-mode AEC / VTS pairing intact */
	return rc;
}

/* Apply now if the sensor is live; otherwise the cache is enough.  Cache-only
   when not configured (the next capture's lazy configure re-applies it after
   OV5640_Init wipes the SDE block) or while the colorbar test pattern is up
   (returning to live re-applies, and we must not disturb its SDE_CTRL4). */
static int apply_if_live_locked(void)
{
	if (!info.configured || cam_colorbar != 0)
		return 0;
	return settings_and_timing_apply_locked();
}

/* ---- capture (locked helpers, issue #41) ---------------------------------- */

/* Remove any leftover signals so a stale post cannot satisfy the next wait. */
static void drain_done(void)
{
	while (tx_semaphore_get(&cam_done, TX_NO_WAIT) == TX_SUCCESS)
		;
}

/* Program the sensor for QVGA RGB565 (once after each power-up) and select
   the live / colorbar source.  Both paths sleep so AEC/AWB or the pattern
   switch settles before the snapshot. */
static int camera_configure_locked(int colorbar)
{
	if (!info.configured) {
		if (OV5640_Init(&ov5640, OV5640_R320x240, OV5640_RGB565)
		    != OV5640_OK) {
			LOG_ERR("OV5640_Init failed");
			return CAM_ERR_HAL;
		}
		info.configured = 1;
		cam_colorbar    = -1;   /* forces the mode block below to run */
		cam_sensor_pclk_hz = 0u;   /* Init reset the PLL; apply_effective re-sets (#67) */
		tx_thread_sleep(CAM_SETTLE_INIT_MS);
	}

	if (cam_colorbar != colorbar) {
		if (OV5640_ColorbarModeConfig(&ov5640,
		                              colorbar ? COLORBAR_MODE_ENABLE
		                                       : COLORBAR_MODE_DISABLE)
		    != OV5640_OK) {
			LOG_ERR("OV5640 colorbar config failed");
			return CAM_ERR_HAL;
		}
		tx_thread_sleep(CAM_SETTLE_MODE_MS);

		/* Re-apply the cached quality settings LAST, in live mode only:
		   OV5640_Init and ColorbarModeConfig(DISABLE) both write the SDE
		   register block (the latter sets SDE_CTRL4), so the settings must
		   land after them or they get clobbered (issue #44).  The colorbar
		   test pattern owns its own SDE_CTRL4 and ignores quality, so skip
		   it there.  cam_colorbar is committed only after a successful apply
		   so a failed apply re-runs this block on the next capture. */
		if (!colorbar) {
			int rc = settings_and_timing_apply_locked();

			if (rc != 0)
				return rc;
		}
		cam_colorbar = colorbar;
	}

	/* Mode unchanged but a prior live apply failed (settings_dirty): retry so
	   the sensor matches the cache.  Skipped in colorbar mode -- quality is
	   irrelevant there and would disturb the test pattern's SDE_CTRL4. */
	if (!colorbar && settings_dirty) {
		int rc = settings_and_timing_apply_locked();

		if (rc != 0)
			return rc;
	}
	return 0;
}

/* ---- mode switch: resolution / pixel format / fps (issue #45) ------------- */

/*
 * Per-resolution timing table.  fps = pclk_hz / (hts * vts); the PCLK is no longer
 * a fixed column -- it is the runtime fps knob (#67), see effective_ov_pclk().
 * HTS/VTS is tightened on the small streamable modes (1600x1000) so 24 MHz gives a
 * clean ~15 fps and 48 MHz exactly doubles it to ~30 fps (48e6/(1600*1000)=30.0);
 * VGA/WVGA keep the full common timing (snapshot-only, frame rate irrelevant, and
 * pinned to 24 MHz).  VTS is the BASE: apply_vts_locked() raises the effective VTS
 * when the AEC max exposure needs more lines and drops it back to this base.
 */
static const struct {
	uint16_t hts;
	uint16_t vts;
} mode_fps[CAM_RES__COUNT] = {
	[CAM_RES_QQVGA]   = { 1600u, 1000u },
	[CAM_RES_QVGA]    = { 1600u, 1000u },
	[CAM_RES_480x272] = { 1600u, 1000u },
	[CAM_RES_VGA]     = { 1936u, 1088u },
	[CAM_RES_WVGA]    = { 1936u, 1088u },
};

/* Only the small modes (QQVGA/QVGA/480x272) are streamable and worth 48 MHz; the
   larger VGA/WVGA modes are snapshot-only and stay at 24 MHz regardless of fps. */
static int res_is_small(uint8_t res)
{
	return res <= CAM_RES_480x272;
}

struct cam_pclk_sel { uint8_t ov; uint32_t hz; };

/*
 * The single safety predicate (#67): 48 MHz (30 fps) only when 30 fps is selected
 * AND the mode is small AND the LTDC is NOT scanning out.  Any missing condition
 * clamps to 24 MHz (15 fps) so the 48 MHz DCMI burst cannot overrun the 16-bit
 * SDRAM that the LTDC reads continuously.  ltdc_scanout_active() is false when the
 * LTDC never came up (no display = no contention), which correctly allows 48 MHz.
 */
static struct cam_pclk_sel effective_ov_pclk(uint8_t res)
{
	struct cam_pclk_sel s = { OV5640_PCLK_24M, 24000000u };

	if (cam_fps_sel == 30u && res_is_small(res) && !ltdc_scanout_active()) {
		s.ov = OV5640_PCLK_48M;
		s.hz = 48000000u;
	}
	return s;
}

/*
 * Re-apply the effective PCLK to the live sensor if it differs from what is
 * actually programmed (cam_sensor_pclk_hz).  Called before arming a stream or a
 * snapshot so the sensor PCLK always matches (fps_sel, res, scanout) even when the
 * scanout state changed since the last set_format -- and it fixes the old #45
 * asymmetry where the snapshot lazy-configure never set PCLK at all.  Caller holds
 * cam_lock with the sensor configured.
 */
static int apply_effective_pclk_locked(void)
{
	struct cam_pclk_sel sel = effective_ov_pclk(mode.res);

	if (sel.hz == cam_sensor_pclk_hz)
		return 0;                         /* already programmed (scanout unchanged) */
	if (OV5640_SetPCLK(&ov5640, sel.ov) != OV5640_OK) {
		cam_sensor_pclk_hz = 0u;          /* desynced: force a re-write next time */
		LOG_ERR("OV5640_SetPCLK failed");
		return CAM_ERR_HAL;
	}
	cam_sensor_pclk_hz = sel.hz;
	mode.pclk_hz       = sel.hz;
	if (mode.hts != 0u && mode.vts != 0u)
		mode.fps_target_x10 = (uint16_t)((uint64_t)sel.hz * 10u /
		                                 ((uint32_t)mode.hts * mode.vts));
	/* SetPCLK writes 0x3036/0x3037 (PLL multiplier / root divider) with no internal
	   delay, so the PLL must re-lock: wait >1 frame before arming (#67, codex). */
	tx_thread_sleep(CAM_SETTLE_MODE_MS);
	return 0;
}

static uint32_t res_to_ov(uint8_t r)
{
	switch (r) {
	case CAM_RES_QQVGA:   return OV5640_R160x120;
	case CAM_RES_480x272: return OV5640_R480x272;
	case CAM_RES_VGA:     return OV5640_R640x480;
	case CAM_RES_WVGA:    return OV5640_R800x480;
	default:              return OV5640_R320x240;   /* QVGA */
	}
}

static uint32_t fmt_to_ov(uint8_t f)
{
	switch (f) {
	case CAM_FMT_YUV422: return OV5640_YUV422;
	case CAM_FMT_Y8:     return OV5640_Y8;
	case CAM_FMT_JPEG:   return OV5640_JPEG;
	default:             return OV5640_RGB565;
	}
}

/* Map the port-neutral format to the pipeline's frame_format (for publish). */
static enum frame_format fmt_to_frame(uint8_t f)
{
	switch (f) {
	case CAM_FMT_YUV422: return FRAME_FMT_YUV422;
	case CAM_FMT_Y8:     return FRAME_FMT_Y8;
	case CAM_FMT_JPEG:   return FRAME_FMT_JPEG;
	default:             return FRAME_FMT_RGB565;
	}
}

