owhinata/stm32f746g-disco/port/camera/camera.c
/*
 * Switch the live resolution / pixel format and apply the per-mode fps timing.
 * Refused while streaming/preview owns the DCMI (the ring is a live target).
 * On any I/O failure the sensor is marked unconfigured and the mode is reset to
 * the QVGA RGB565 default, so a half-applied sensor/DCMI state never persists --
 * the next capture full-re-inits to a state that matches the descriptor (#45).
 * cam_lock held by the caller.
 */
static int camera_set_format_locked(uint8_t res, uint8_t fmt)
{
	struct camera_mode m;
	int jpeg = (fmt == CAM_FMT_JPEG);
	int rc;

	if (cam_stream_active || cam_ext_sink != NULL)
		return CAM_ERR_BUSY;           /* streaming/preview owns the DCMI/DMA */
	if (!sdram_is_up())
		return CAM_ERR_STATE;
	if (res >= CAM_RES__COUNT || fmt >= CAM_FMT__COUNT)
		return CAM_ERR_PARAM;
	if (jpeg && res > CAM_RES_VGA)
		return CAM_ERR_PARAM;          /* JPEG is snapshot-only, gated <= VGA */

	/* Candidate mode: geometry from res + HTS/VTS from the timing table + the
	   effective PCLK from the fps knob (#67).  Validate capacity before the sensor. */
	struct cam_pclk_sel psel = effective_ov_pclk(res);

	m = (struct camera_mode){ .res = res, .format = fmt,
	    .hts = mode_fps[res].hts, .vts = mode_fps[res].vts,
	    .pclk_hz = psel.hz };
	mode_recompute(&m);
	if (m.frame_bytes > CAM_FRAME_MAX_BYTES)
		return CAM_ERR_PARAM;

	if (!info.powered) {
		rc = camera_probe_locked(NULL);
		if (rc != 0)
			return rc;
	}

	/* A JPEG <-> raster change cannot be applied incrementally: the lib's
	   OV5640_SetPixelFormat SETS the JPEG datapath bits (TIMING_TC_REG21 /
	   SYSREM_RESET02 / CLOCK_ENABLE02) but never clears them, so a raster capture
	   after a JPEG one wedges (no sync -> timeout).  Force a clean sensor re-init:
	   clearing IsInitialized lets OV5640_Init re-run the common table, whose first
	   write is a software reset (SYSTEM_CTROL0=0x82) that restores those bits.
	   Toggle the DCMI JPEGMode to match. */
	if (jpeg != (int)mode.is_jpeg) {
		ov5640.IsInitialized = 0U;
		info.configured = 0;
		if (dcmi_set_jpeg(jpeg) != 0) {
			LOG_ERR("DCMI JPEG re-init failed");
			goto fail;
		}
	}

	if (!info.configured) {
		if (OV5640_Init(&ov5640, OV5640_R320x240, OV5640_RGB565) != OV5640_OK) {
			LOG_ERR("OV5640_Init failed");
			goto fail;
		}
		info.configured = 1;
		cam_sensor_pclk_hz = 0u;   /* Init reprogrammed the PLL to its default (#67) */
		tx_thread_sleep(CAM_SETTLE_INIT_MS);
	}

	if (OV5640_SetResolution(&ov5640, res_to_ov(res)) != OV5640_OK)
		goto fail;
	if (OV5640_SetPixelFormat(&ov5640, fmt_to_ov(fmt)) != OV5640_OK)
		goto fail;
	if (OV5640_SetPCLK(&ov5640, psel.ov) != OV5640_OK)      /* fps knob (#67) */
		goto fail;
	cam_sensor_pclk_hz = psel.hz;   /* sensor now matches the effective selection */

	/* Commit the base mode now: the quality re-apply + timing below needs the
	   committed mode (ZoomConfig reads the new DVPHO/DVPVO, night mode rewrites
	   AEC, and apply_vts writes the effective VTS from mode.hts/vts).  A failure
	   after this lands in the fail path, which resets to the default. */
	mode = m;
	rc = settings_and_timing_apply_locked();   /* SDE settings + HTS/VTS clamp */
	if (rc != 0)
		goto fail;

	info.frame_valid = 0;              /* geometry changed: old frame is stale */
	info.frame_bytes = 0;
	cam_colorbar     = -1;             /* next capture re-establishes live/colorbar */
	tx_thread_sleep(CAM_SETTLE_MODE_MS);
	return 0;

fail:
	/* Consistent fallback: mode + DCMI reset to the QVGA RGB565 default and the
	   sensor flagged for re-init, so a half-applied sensor/DCMI/mode state never
	   persists -- the next capture re-programs to a state matching the descriptor. */
	info.configured  = 0;
	info.frame_valid = 0;
	info.frame_bytes = 0;
	cam_colorbar     = -1;
	mode_reset_default();
	LOG_ERR("camera_set_format(res=%u fmt=%u) failed", (unsigned)res,
	        (unsigned)fmt);
	return CAM_ERR_HAL;
}

/* Rebuild the DMA stream after an aborted snapshot.  A VGA/WVGA snapshot runs
   the HAL intra-frame banding path, which sets CR.DBM; a normal completion
   self-heals (the next Start clears or re-sets DBM as needed), but an aborted
   banded transfer (timeout / DCMI error) can leave DBM/CT stale, so re-init the
   stream to a clean DMA_NORMAL state for the next capture (#45 R8). */
static void snapshot_dma_reinit(void)
{
	(void)HAL_DMA_DeInit(&hdma_dcmi);
	(void)HAL_DMA_Init(&hdma_dcmi);
	__HAL_LINKDMA(&hdcmi, DMA_Handle, hdma_dcmi);
}

/* Validate + EOI-trim a JPEG frame in @p buf.  @p eff_bytes is how many bytes the
   DMA actually wrote (budget - NDTR, in bytes); the real stream is shorter because
   the DCMI zero-pads the last 32-bit word.  Verify the SOI (0xFFD8) at the start
   and scan backward within eff_bytes for the EOI marker (0xFFD9); on success
   *valid receives the trimmed length (EOI+2).  No SOI/EOI -> truncated (CAM_ERR_HAL).
   Only the captured range is scanned (the .sdram buffer is NOLOAD: it can hold an
   older/garbage tail beyond eff_bytes).  Silent: the caller logs / counts -- this
   serves both the snapshot finalize and the JPEG streaming producer (#63). */
static int jpeg_trim(const uint8_t *buf, uint32_t eff_bytes, uint32_t *valid)
{
	uint32_t i;

	if (eff_bytes < 4u || buf[0] != 0xFFu || buf[1] != 0xD8u)
		return CAM_ERR_HAL;                    /* no SOI */
	for (i = eff_bytes; i >= 2u; i--) {
		if (buf[i - 2u] == 0xFFu && buf[i - 1u] == 0xD9u) {
			*valid = i;                        /* include the EOI marker */
			return 0;
		}
	}
	return CAM_ERR_HAL;                        /* no EOI: truncated */
}

static int camera_capture_locked(int colorbar)
{
	int rc;

	if (!sdram_is_up())
		return CAM_ERR_STATE;

	if (cam_stream_active)
		return CAM_ERR_BUSY;    /* streaming owns the DCMI/DMA (issue #46) */

	if (!info.powered) {
		rc = camera_probe_locked(NULL);
		if (rc != 0)
			return rc;
	}

	rc = camera_configure_locked(colorbar);
	if (rc != 0)
		return rc;

	/* Program the effective PCLK for the fps knob + current scanout state (#67);
	   also covers the old #45 asymmetry (lazy configure never set PCLK). */
	rc = apply_effective_pclk_locked();
	if (rc != 0)
		return rc;

	info.frame_valid = 0;
	drain_done();
	cam_xfer_err    = 0;
	cam_xfer_active = 1;

