owhinata/stm32f746g-disco/port/camera/camera.c
	/* Re-arm the error interrupts: HAL_DCMI_Init enabled LINE/VSYNC/ERR/OVR
	   once, but the snapshot FRAME ISR disables them all
	   (stm32f7xx_hal_dcmi.c FRAME handling), and HAL_DCMI_Start_DMA does not
	   re-enable them -- without this, an overrun/sync error on the second and
	   later captures would surface as a timeout instead of CAM_ERR_HAL.
	   LINE/VSYNC stay off (nothing consumes them; they fire per line/frame).
	   Clear stale flags first so an old latched error cannot trip the ISR
	   the moment the interrupt enables. */
	__HAL_DCMI_CLEAR_FLAG(&hdcmi, DCMI_FLAG_ERRRI | DCMI_FLAG_OVRRI |
	                              DCMI_FLAG_FRAMERI | DCMI_FLAG_LINERI |
	                              DCMI_FLAG_VSYNCRI);
	/* JPEG is a variable-length frame: the DMA never completes (the budget
	   exceeds the stream), so the DMA-complete path that arms the FRAME
	   interrupt for a raster snapshot never runs.  Enable FRAME explicitly so the
	   hardware end-of-frame (RM0385 17.4) still wakes us. */
	__HAL_DCMI_ENABLE_IT(&hdcmi, DCMI_IT_ERR | DCMI_IT_OVR |
	                             (mode.is_jpeg ? DCMI_IT_FRAME : 0u));

	/* One contiguous transfer of mode.frame_words.  QVGA = 38400 words runs a
	   plain single DMA; VGA/WVGA exceed 65535 words and HAL_DCMI_Start_DMA
	   transparently bands them (intra-frame DBM into this one buffer), firing
	   FRAME once at the end either way.  No cache maintenance -- cam_frame is in
	   the MPU non-cacheable SDRAM. */
	if (HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, (uint32_t)cam_frame,
	                       mode.frame_words) != HAL_OK) {
		cam_xfer_active = 0;
		(void)HAL_DCMI_Stop(&hdcmi);
		drain_done();
		LOG_ERR("DCMI start failed (err 0x%lx)",
		        (unsigned long)HAL_DCMI_GetError(&hdcmi));
		return CAM_ERR_HAL;
	}

	/* The banded (>64 KB) path goes through HAL_DMAEx_MultiBufferStart_IT, which
	   -- unlike the single-transfer HAL_DMA_Start_IT -- enables the DMA FIFO/direct
	   -mode error interrupts.  Under SDRAM contention these FE/DME fire and HAL's
	   DCMI_DMAError aborts the whole snapshot, so VGA/WVGA captures spuriously fail
	   with CAM_ERR_HAL.  Per RM0385 8.5.5 FE/DME do NOT stop the stream, so silence
	   them; a real transfer error (TE) and the DCMI overrun/sync error (DCMI_IT_OVR
	   /ERR) stay terminal.  Harmless on the single-transfer path: FE is off there,
	   and DME (enabled by HAL_DMA_Start_IT too) is benign to silence for a snapshot. */
	__HAL_DMA_DISABLE_IT(&hdma_dcmi, DMA_IT_FE);
	__HAL_DMA_DISABLE_IT(&hdma_dcmi, DMA_IT_DME);

	if (tx_semaphore_get(&cam_done, CAM_XFER_TIMEOUT_TICKS) != TX_SUCCESS) {
		cam_xfer_active = 0;
		(void)HAL_DCMI_Stop(&hdcmi);
		snapshot_dma_reinit();   /* clear any stale banding DBM/CT */
		drain_done();
		LOG_ERR("frame timed out (no DCMI sync? check wiring)");
		return CAM_ERR_TIMEOUT;
	}
	cam_xfer_active = 0;

	if (cam_xfer_err) {
		(void)HAL_DCMI_Stop(&hdcmi);
		snapshot_dma_reinit();   /* clear any stale banding DBM/CT */
		drain_done();
		LOG_ERR("capture error (HAL err 0x%lx)",
		        (unsigned long)HAL_DCMI_GetError(&hdcmi));
		return CAM_ERR_HAL;
	}

	/* Snapshot auto-cleared CAPTURE; Stop also disables the DCMI, aborts the DMA
	   and leaves the HAL in a clean READY state for the next capture. */
	(void)HAL_DCMI_Stop(&hdcmi);

	if (mode.is_jpeg) {
		/* The DMA was aborted mid-stream by Stop; NDTR holds the untransferred
		   word count, so (budget - NDTR) words were written.  Read it AFTER Stop
		   (not before -- the abort settles NDTR), then trim to the JPEG EOI. */
		uint32_t ndtr = __HAL_DMA_GET_COUNTER(&hdma_dcmi);
		uint32_t eff  = (mode.frame_words - ndtr) * 4u;
		uint32_t valid;

		rc = jpeg_trim(cam_frame, eff, &valid);
		if (rc != 0) {
			LOG_ERR("JPEG finalize failed (eff=%lu)", (unsigned long)eff);
			info.frame_valid = 0;
			return rc;
		}
		info.frame_bytes = valid;              /* trimmed JPEG stream length */
	} else {
		info.frame_bytes = mode.frame_bytes;   /* raster: full frame valid */
	}
	cam_frame_gen++;        /* new pixels: multi-call readers must notice */
	info.frame_valid = 1;
	return 0;
}

/* ---- public API ----------------------------------------------------------- */

int camera_capture(int colorbar)
{
	int rc = op_lock();
	if (rc != 0)
		return rc;
	rc = camera_capture_locked(colorbar != 0);
	op_unlock();
	return rc;
}

int camera_set_format(enum camera_res res, enum camera_format fmt)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	rc = camera_set_format_locked((uint8_t)res, (uint8_t)fmt);
	op_unlock();
	return rc;
}

int camera_set_fps(unsigned fps)
{
	uint8_t prev;
	int rc;

	if (fps != 15u && fps != 30u)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	/* Re-apply to the live sensor the same way `camera res` / `camera format` do:
	   rebuild the current mode so the new effective PCLK is reprogrammed at once.
	   Inherits the set_format BUSY gate (refused while a stream/preview owns the
	   DCMI) -- the sensor PLL must not be retuned under a live DMA target (#67).
	   On any failure (BUSY / I/O) restore the previous selection so the stored
	   preference never diverges from what the sensor actually got -- otherwise
	   camera_get_mode() would report an fps the live sensor never received. */
	prev = cam_fps_sel;
	cam_fps_sel = (uint8_t)fps;
	rc = camera_set_format_locked(mode.res, mode.format);
	if (rc != 0)
		cam_fps_sel = prev;
	op_unlock();
	return rc;
}

int camera_frame_read(uint32_t offset, void *dst, uint32_t len,
                      uint32_t *gen)
{
	int rc;

	if (dst == NULL || len == 0u)
		return CAM_ERR_PARAM;

	rc = op_lock();
	if (rc != 0)
		return rc;
	if (!info.frame_valid) {
		op_unlock();
		return CAM_ERR_NO_FRAME;
	}
	/* Bound against the captured frame's valid length under the lock: the live
	   mode (hence the valid byte count, and for JPEG the trimmed stream length)
	   can change between captures.  Subtraction form so offset+len cannot wrap. */
	if (offset >= info.frame_bytes ||
	    len > info.frame_bytes - offset) {
		op_unlock();
		return CAM_ERR_PARAM;
	}
	memcpy(dst, (const uint8_t *)cam_frame + offset, len);
	if (gen != NULL)
		*gen = cam_frame_gen;
	op_unlock();
	return 0;
}

void camera_frame_invalidate(void)
{
	if (op_lock() != 0)
		return;
	info.frame_valid = 0;
	op_unlock();
}

int camera_streaming(void)
{
	return cam_stream_active;   /* volatile; a destructive .sdram op must refuse */
}

int camera_probe(uint32_t *chip_id)
{
	int rc = op_lock();
	if (rc != 0)
		return rc;
	if (cam_stream_active) {          /* streaming owns the sensor/DCMI (#46) */
		op_unlock();
		return CAM_ERR_BUSY;
	}
	rc = camera_probe_locked(chip_id);
	op_unlock();
	return rc;
}

