owhinata/stm32f746g-disco/port/camera/camera.c
int camera_power_off(void)
{
	int rc = op_lock();
	if (rc != 0)
		return rc;
	if (cam_stream_active) {          /* cutting power mid-stream wrecks the HW */
		op_unlock();
		return CAM_ERR_BUSY;
	}
	power_off_locked();
	op_unlock();
	return 0;
}

int camera_get_info(struct camera_info *out)
{
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	*out = info;
	op_unlock();
	return 0;
}

int camera_get_mode(struct camera_mode *out)
{
	struct cam_pclk_sel sel;
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	*out = mode;
	/* Evaluate the fps clamp live against the current LTDC scanout state (#67), so
	   `camera info` reflects whether 30 fps is actually in effect right now -- the
	   sensor PCLK is only re-applied at the next capture/stream arm, but the report
	   must be current.  Report the live-effective PCLK / fps target, not a stale
	   last-programmed value. */
	sel = effective_ov_pclk(mode.res);
	out->fps_sel = cam_fps_sel;
	out->fps_eff = (sel.hz >= 48000000u) ? 30u : 15u;
	if (cam_fps_sel == 30u && out->fps_eff == 15u)
		out->fps_clamp = res_is_small(mode.res) ? CAM_FPS_CLAMP_LTDC
		                                        : CAM_FPS_CLAMP_SIZE;
	else
		out->fps_clamp = CAM_FPS_OK;
	out->pclk_hz = sel.hz;
	if (mode.hts != 0u && mode.vts != 0u)
		out->fps_target_x10 = (uint16_t)((uint64_t)sel.hz * 10u /
		                                 ((uint32_t)mode.hts * mode.vts));
	op_unlock();
	return 0;
}

/* ---- quality settings public API (issue #44) ----------------------------- */

int camera_get_settings(struct camera_settings *out)
{
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	*out = settings;
	op_unlock();
	return 0;
}

/* Shared tail for every level setter: takes the mutex, stashes the validated
   value (already range-checked) and re-applies if the sensor is live.
   @field points into `settings`. */
static int set_level(int8_t *field, int value)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	*field = (int8_t)value;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_brightness(int level)
{
	if (level < CAM_LEVEL_MIN || level > CAM_LEVEL_MAX)
		return CAM_ERR_PARAM;
	return set_level(&settings.brightness, level);
}

int camera_set_contrast(int level)
{
	if (level < CAM_LEVEL_MIN || level > CAM_LEVEL_MAX)
		return CAM_ERR_PARAM;
	return set_level(&settings.contrast, level);
}

int camera_set_saturation(int level)
{
	if (level < CAM_LEVEL_MIN || level > CAM_LEVEL_MAX)
		return CAM_ERR_PARAM;
	return set_level(&settings.saturation, level);
}

int camera_set_hue(int degrees)
{
	if (degrees < CAM_HUE_MIN * 30 || degrees > CAM_HUE_MAX * 30 ||
	    (degrees % 30) != 0)
		return CAM_ERR_PARAM;
	return set_level(&settings.hue, degrees / 30);
}

int camera_set_awb(enum camera_awb mode)
{
	int rc;

	if ((unsigned)mode > CAM_AWB_CLOUDY)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.awb = (uint8_t)mode;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_effect(enum camera_effect effect)
{
	int rc;

	if ((unsigned)effect > CAM_FX_GREEN)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.effect = (uint8_t)effect;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_flip(enum camera_flip flip)
{
	int rc;

	if ((unsigned)flip > CAM_FLIP_BOTH)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.flip = (uint8_t)flip;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_zoom(int factor)
{
	int rc;

	if (factor != 1 && factor != 2 && factor != 4 && factor != 8)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.zoom = (uint8_t)factor;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_night(int on)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	settings.night = on ? 1u : 0u;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_defaults(void)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	settings.brightness = 0;
	settings.contrast   = 0;
	settings.saturation = 0;
	settings.hue        = 0;
	settings.awb        = CAM_AWB_AUTO;
	settings.effect     = CAM_FX_NONE;
	settings.flip       = CAM_FLIP_NONE;
	settings.zoom       = 1;
	settings.night      = 0;
	settings_dirty      = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

/* ---- streaming producer (issue #46) -------------------------------------- */

/* frame_os: the pipeline core's injected mutual exclusion (a TX_MUTEX, distinct
   from the driver cam_lock).  The core is only ever entered from the producer
   thread (and start/stats under cam_lock), never from an ISR. */
static void cam_pipe_os_lock(void *ctx)
{
	(void)ctx;
	(void)tx_mutex_get(&cam_pipe_lock, TX_WAIT_FOREVER);
}

static void cam_pipe_os_unlock(void *ctx)
{
	(void)ctx;
	(void)tx_mutex_put(&cam_pipe_lock);
}

static const struct frame_os cam_pipe_os = {
	NULL, cam_pipe_os_lock, cam_pipe_os_unlock
};

/* Counting sink: the display-independent FPS / throughput consumer.  DROP
   policy and it returns each frame's pin immediately (no holding), so the
   producer is never blocked -- exactly the #46 measurement target.  The core
   keeps delivered/dropped. */
static int cam_stat_open(void *ctx, enum frame_format fmt, uint16_t w, uint16_t h)
{
	(void)ctx;
	(void)fmt;
	(void)w;
	(void)h;
	return 0;   /* counting sink: accepts whatever the producer publishes (#45) */
}

static int cam_stat_consume(void *ctx, const struct frame_desc *f)
{
	(void)ctx;
	frame_pipeline_put(&cam_pipe, &cam_stat_sink, f);
	return 0;
}

/* DMA transfer-complete (ISR context): one ring buffer just filled.  Only wakes
   the producer; it touches no ring / pipeline / CT state (the #47 ISR rule). */
static void cam_stream_dma_cb(DMA_HandleTypeDef *h)
{
	(void)h;
	if (!cam_stream_active)
		return;
	(void)tx_semaphore_put(&cam_stream_sem);
}

/* DMA error callback.  The double-buffer arm (HAL_DMAEx_MultiBufferStart_IT)
   enables the FIFO-error interrupt the snapshot path (HAL_DMA_Start_IT) leaves
   off.  FE (FIFO) and DME (direct-mode) errors are transient under SDRAM
   contention (LTDC continuously reads the framebuffer) and, per RM0385 8.5.5,
   do NOT disable the stream -- the snapshot path simply never sees them.  So
   count and ignore them (cam_stream_fe); only a transfer error (TE), which the
   hardware uses to actually halt the stream, is terminal (#56). */
static void cam_stream_dma_err_cb(DMA_HandleTypeDef *h)
{
	if (!cam_stream_active)
		return;
	if (!(h->ErrorCode & HAL_DMA_ERROR_TE)) {
		cam_stream_fe++;                    /* FE/DME: non-fatal, keep streaming */
		/* HAL clears the FE/DME flags but not h->ErrorCode; clear the tolerated
		   bits ourselves so HAL_DMA_IRQHandler does not re-enter this callback on
		   every following (TC) interrupt while ErrorCode stays nonzero. */
		h->ErrorCode &= ~(HAL_DMA_ERROR_FE | HAL_DMA_ERROR_DME);
		return;
	}
	cam_stream_err = 1;
	(void)tx_semaphore_put(&cam_stream_sem);
}

static void drain_stream_sem(void)
{
	while (tx_semaphore_get(&cam_stream_sem, TX_NO_WAIT) == TX_SUCCESS)
		;
	/* A start kick that landed while the producer was already active lingers on
	   cam_start_sem; clear it so a later idle wait blocks instead of spinning
	   once. */
	while (tx_semaphore_get(&cam_start_sem, TX_NO_WAIT) == TX_SUCCESS)
		;
}

