owhinata/stm32f746g-disco/port/camera/camera.c
static uint32_t cam_elapsed_ms;   /* frozen at teardown for post-stop `stats` */

/* Stop the stream and restore a clean snapshot-ready DCMI/DMA.  Producer-thread
   only (single owner): start / stop / auto-stop / OVR all converge here, so the
   HW teardown never races the producer's repoint.  Short cam_lock for the state
   transition (serialises with start / stats). */
static void cam_stream_teardown(void)
{
	(void)tx_mutex_get(&cam_lock, TX_WAIT_FOREVER);
	if (cam_stream_active) {
		cam_stream_active = 0;
		cam_elapsed_ms = HAL_GetTick() - cam_start_tick;
		(void)HAL_DCMI_Stop(&hdcmi);          /* aborts the DMA internally */
		/* The JPEG snapshot-loop arms DCMI_IT_FRAME, but HAL_DCMI_Stop does NOT
		   clear interrupt-enables (HAL only disables FRAME inside the FRAME IRQ).
		   A timeout-driven stop (--secs / stop) tears down between FRAMEs with
		   FRAME still armed, so a later raster stream -- which assumes FRAME is
		   disabled -- would take a spurious cam_stream_sem.  Disable it here (#63;
		   a no-op for the raster path that never enabled it). */
		__HAL_DCMI_DISABLE_IT(&hdcmi, DCMI_IT_FRAME);
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		/* Async stop (OVR/DMA error/auto-stop) while a GUIX preview owns the
		   stream: detach its sink too and release ownership, so the next
		   frame_pipeline_init() (a later start) cannot memset a still-linked
		   sink.  The GUIX sink is synchronous (no cross-thread pin) and its
		   close() is a no-op, so a producer-thread detach is safe here. */
		if (cam_ext_sink != NULL) {
			(void)frame_pipeline_detach(&cam_pipe, cam_ext_sink);
			cam_ext_sink = NULL;
		}
		drain_stream_sem();
		/* HAL_DCMI_Stop leaves CR.DBM set on the stream; re-init the DMA so the
		   next snapshot's HAL_DCMI_Start_DMA runs a plain single transfer. */
		(void)HAL_DMA_DeInit(&hdma_dcmi);
		hdma_dcmi.Init.Mode = DMA_NORMAL;
		(void)HAL_DMA_Init(&hdma_dcmi);
		__HAL_LINKDMA(&hdcmi, DMA_Handle, hdma_dcmi);
		LOG_INF("stream stop (%lu frames, ovr dcmi=%lu ring=%lu fe=%lu)",
		        (unsigned long)cam_pipe.stats.published,
		        (unsigned long)cam_stream_ovr, (unsigned long)cam_ring_ovr,
		        (unsigned long)cam_stream_fe);
	}
	(void)tx_mutex_put(&cam_lock);
}

/* Service one completed frame: find the completed buffer via CT, secure a free
   slot, repoint the completed M-register away, THEN publish.  This ordering
   keeps a published slot off the live DMA target list, so a sink never reads a
   buffer the DMA is about to overwrite (tear-free).  No free slot -> drop. */
static void cam_stream_service(int had_sem)
{
	uint32_t ct, seen, extra = 0;
	struct frame_desc *done, *freed;
	int published = 0;

	/* Stop conditions (also handles the bounded-timeout wake with no frame). */
	if (cam_stop_req || cam_stream_err ||
	    (cam_target_frames && cam_pipe.stats.published >= cam_target_frames) ||
	    (cam_target_secs &&
	     (HAL_GetTick() - cam_start_tick) >= cam_target_secs * 1000u)) {
		cam_stream_teardown();
		return;
	}

	/* Completions observed this pass (one semaphore each): the wake plus any
	   drained extras.  We publish at most the most-recent buffer flip; every
	   other observed completion was overwritten -> ring overrun. */
	while (tx_semaphore_get(&cam_stream_sem, TX_NO_WAIT) == TX_SUCCESS)
		extra++;
	seen = (had_sem ? 1u : 0u) + extra;

	ct = (DMA2_Stream1->CR & DMA_SxCR_CT) ? 1u : 0u;
	if (ct != cam_last_ct) {
		cam_last_ct = ct;
		/* CT==1 -> M0 just completed; CT==0 -> M1 just completed (the HAL
		   HAL_DMA_IRQHandler DBM dispatch mirrors this). */
		done = ct ? cam_m0 : cam_m1;
		freed = frame_pipeline_acquire(&cam_pipe);
		if (freed != NULL) {
			if (ct) {
				(void)HAL_DMAEx_ChangeMemory(&hdma_dcmi,
				        (uint32_t)freed->data, MEMORY0);
				cam_m0 = freed;
			} else {
				(void)HAL_DMAEx_ChangeMemory(&hdma_dcmi,
				        (uint32_t)freed->data, MEMORY1);
				cam_m1 = freed;
			}
			frame_pipeline_publish(&cam_pipe, done, mode.frame_bytes,
			                       fmt_to_frame(mode.format), mode.width,
			                       mode.height,
			                       (uint16_t)(mode.width *
			                                  mode.bytes_per_pixel));
			published = 1;
		}
		/* freed == NULL: no free slot, drop (do not publish); the M-reg keeps
		   pointing at `done`, so the DMA simply refills it next cycle. */
	}
	if (seen > (uint32_t)published)
		cam_ring_ovr += seen - (uint32_t)published;
}

/* ---- JPEG variable-length streaming (issue #63) -------------------------- */
/*
 * JPEG cannot ride the raster DBM/TC path: a JPEG frame is shorter than the DMA
 * budget, so the transfer-complete interrupt never fires at the frame boundary.
 * Instead each frame is a single DCMI SNAPSHOT (CM=1) into one ring slot, and the
 * DCMI FRAME interrupt (the same end-of-frame the snapshot path uses) delimits it.
 * After each frame the DCMI stops capturing on its own, so re-arming into the next
 * slot cannot overrun the FIFO mid-gap (a CM=0 continuous re-point would).  The
 * producer thread owns all of Stop / finalize / publish / re-arm; the ISR only
 * posts cam_stream_sem.  Frames that fall in the Stop..re-arm gap are dropped.
 */

/* Arm one JPEG snapshot DMA into @p slot and enable the FRAME interrupt (the
   variable-length boundary).  Mirrors the snapshot arm sequence; returns the HAL
   status so the caller can treat a failed (re-)arm as terminal. */
static HAL_StatusTypeDef cam_jpeg_arm(struct frame_desc *slot)
{
	HAL_StatusTypeDef st;

	__HAL_DCMI_CLEAR_FLAG(&hdcmi, DCMI_FLAG_ERRRI | DCMI_FLAG_OVRRI |
	                              DCMI_FLAG_FRAMERI | DCMI_FLAG_LINERI |
	                              DCMI_FLAG_VSYNCRI);
	__HAL_DCMI_ENABLE_IT(&hdcmi, DCMI_IT_ERR | DCMI_IT_OVR | DCMI_IT_FRAME);
	st = HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, (uint32_t)slot->data,
	                        CAM_JPEG_BUDGET_WORDS);
	if (st != HAL_OK)
		return st;
	/* The banding path enables the DMA FIFO/direct-mode error interrupts; under
	   SDRAM contention HAL's DCMI_DMAError would abort the capture, so silence the
	   non-fatal FE/DME the way the snapshot path does (#45 R8). */
	__HAL_DMA_DISABLE_IT(&hdma_dcmi, DMA_IT_FE);
	__HAL_DMA_DISABLE_IT(&hdma_dcmi, DMA_IT_DME);
	return HAL_OK;
}

